{
  "mainText": ["Semero carefully wrapped Arvanka in blankets, shielding her from cold and trying to warm her up. As he did so, he couldn't help but feel a sense of despair. Wagon, which had once been a powerful magical artifact, was now just an ordinary empty cart. Escaped wizard who had taken form of Semero had taken all magic with him.", "With Arvanka safely bundled up, Semero gathered all his belongings and donned his spare cloak. He needed to leave cave and make their way through treacherous snowstorm. He drew his sword, ready for whatever dangers lay ahead.", "As he made his way through snowstorm, Semero could barely see where he was going. Wind howled around him, threatening to knock him off their feet at any moment.", "Hours passed, Semero trudging through snow, each step taking them closer to their destination. Just when he thought that he couldn't go on any longer, road started to slope downward.", "Prince Semero carefully picked his way down treacherous mountain path, his thoughts still preoccupied with safety of Arvanka back in cave. He couldn't shake feeling that mountain wolves were still lurking in shadows, waiting to pounce on traveler.", "As he turned a bend in path, Semero was confronted with a strange and unexpected sight. A massive mountain loomed before him, its rugged face blocking path ahead. And on face of mountain, Semero could make out a huge wooden gate, like ones he had seen in castle of his youth.", "Curiosity piqued, Semero approached gate, his heart pounding in his chest. He reached out to grasp handle, but to his dismay, gates refused to budge. They were massive and heavy, and no amount of force seemed to be enough to move them.", "Just as Semero was about to give up, a voice boomed out from nowhere, causing him to startle and drop his sword. He looked around, but there was no one in sight. Then, he realized that voice was coming from gate itself.", "Chipped head on gate spoke to him, and Semero felt a shiver run down his spine. It was magic, there was no doubt about it. He had heard of talking objects before, but he had never seen one in person.", "\"Who are you?\" voice demanded, and Semero took a deep breath, steeling himself for what was to come. He knew that gate was not going to let him pass without some sort of test or challenge.", "\"My name is Semero,\" he said, his voice echoing through stillness. \"I must pass.\"", "Voice was low and rough, like grinding of stones. \"You would pass through here, young man? Then you must answer my riddle.\"", "Semero arched an eyebrow, intrigued. He had always been fond of riddles, and he felt a thrill of excitement at challenge.", "\"Ask away,\" he said.", "Head laughed, its lips curving into a crooked grin. \"Very well. Listen closely, for this is not an easy one. What is greater than God, more evil than devil, poor have it, rich need it, and if you eat it, you will die?\"", "Semero's mind raced, trying to untangle web of words. Answer eluded him, but he refused to give up.", "\"It's coming,\" he said, hoping to buy himself some time. \"Make a guess!\"", "Head chuckled again, its eyes gleaming with mischief. \"Oh, I could guess, but what fun would that be? Instead, I will give you three options. Listen well, for only one is true, and another two give you nothing. Is answer: Nothing, Greed or Envy?", "Semero weighed options carefully, his eyes darting from one to other. He knew that wrong choice could mean failure, or worse."],
  "talkOption": ["Finally, he made his decision. \"My answer is Nothing.\""],
  "talkOptionResult": ["For a moment, head said nothing, its expression inscrutable. Then, slowly, gate began to creak open, revealing a path that led deep into dark.", "\"Very good,\" said head, its voice softening slightly. \"You have passed test, young man. May road ahead be kinder than one behind.\"", "And with those words, Semero stepped through gate and into unknown.", "As prince Semero continued his journey through dark and winding corridors, he felt his heart quicken with anticipation. Air was thick with scent of ancient stone and dampness, and he could hear nothing but sound of his own footsteps echoing off walls. He wondered if he was truly alone in this place, or if there were other watchers, hidden in shadows.", "Then, up ahead, he saw it - an archway, beckoning him forward with its eerie glow. He quickened his pace, feeling a strange mixture of fear and excitement.", "But as he drew closer, his heart began to pound in his chest. For standing before him was a figure, shrouded in a dark cloak that seemed to blend with shadows. Figure's face was hidden beneath hood, and Semero could not tell if it was human or something else entirely.", "He hesitated, wondering if he should turn back or press on. But then figure spoke, its voice a low whisper that seemed to emanate from all around him.", "\"Who are you, and what brings you here?\" it asked, its words echoing off stone walls.", "Semero swallowed, his mouth suddenly dry. \"I am Prince Semero,\" he said, his voice barely above a whisper.", "Figure said nothing, but its eyes seemed to bore into him, as if probing his thoughts. Semero felt a shiver run down his spine, and he wondered if he had made a terrible mistake.", "But then, as suddenly as it had appeared, figure stepped aside, its cloak swirling around its feet like smoke.", "\"Pass through, Prince Semero,\" it said. \"May blood you seek be found.\"", "Semero hesitated for a moment longer, then stepped forward, his heart pounding in his chest. As he passed through archway, he felt a rush of cold air wash over him, and crack in ceiling above him grew wider, revealing a bright light beyond.", "Prince Semero stepped through archway and into a vast, dimly lit chamber. Air was thick with scent of age and dust, and sound of his footsteps echoed off stone walls.", "He looked around, taking in strange and alien sights before him. Walls were adorned with intricate carvings, depicting creatures and scenes that he could not begin to understand. In the center of chamber, a set of winding stairs led upwards, disappearing into shadows above.", "Semero felt a thrill of excitement and fear in equal measure. He knew that he must climb those stairs if he wanted to save Arvanka. With a deep breath, he began to ascend.", "Stairs were narrow and steep, and prince felt his muscles straining as he climbed higher and higher. He could feel sweat dripping down his face and cold stone beneath his fingertips. But he pressed on, driven by a determination that he did not fully understand.", "After what felt like hours of climbing, he emerged from the darkness and into the light."]
}
