{
  "mainText": ["Semero slowly opened his eyes and was met with the morning light. He felt a sharp pain in his head and he reached up to touch the back of his head. He realized that he must have hit his head on something. He groaned in pain as he tried to remember what had happened, but all he could recall was a blur of images. He slowly sat up, feeling dizzy and disoriented, and looked around to try to get his bearings.", "Prince sat on the grass, looking up at the hill he had stopped at the night before. He remembered how he had been attacked by nightmarish monsters, and a chill ran down his spine. A shadow hung over Semero from behind, and when the prince turned around he saw a man.", "He asked prince in a very formal and unemotional manner, \"How are you?\" Semero responded with a confused expression and simply said, \"My head is hurts.\"", "Stranger reached into the bag hanging from his belt and pulled out a strange blue stone. He held it up to the light, examining it closely. It was smooth and cool to the touch, and seemed to be glowing with an inner light. He handed it to the prince and said, \"My name is Austin Jorgall. Get this stone and put it where it hurts.\" Prince looked at Austin curiously, but accepted the stone without question.", "Semero started to come to his senses and the pain in his head began to subside. He looked around and noticed that Austin had gone somewhere and had not yet returned. He felt a little uneasy, but he was still too weak to do anything about it. He lay there, waiting for Austin's return, hoping that everything would be alright.", "As Semero waited, he examined the blue stone in his hand. It was unlike anything he had ever seen before. Semero sat there for a moment, holding the blue stone in his hand and feeling its cool, smooth surface. He wondered how such a small object could hold so much power. He wondered what kind of person Austin Jorgall was and why he was carrying such a strange stone.", "After a few moments, Semero heard footsteps approaching from behind him. He turned around and saw Austin walking towards him. \"How do you feel now?\" Austin asked."],
  "talkOption": ["\"Much better, thank you,\" Semero replied. \"What was that stone you gave me?\""],
  "talkOptionResult": ["\"It's called a healing stone,\" Austin said. \"It has the power to heal any injury or ailment. I've been carrying it with me for a long time, just in case I ever needed it.\""]
}
