{
  "mainText": ["Semero was amazed. He had never heard of such a thing before. \"Thank you. I don't know how to repay you for your kindness.\"",
    "Austin looked at the prince and said, \"I'm only helping you because I have my own reasons.\" He sat down on the ground a few steps away from the prince and placed his sword next to him. \"I tried to find your horse in the area, but it seems to have run off. You're lucky to be alive after what happened last night.\"",
    "Semero looked at Austin with a mix of confusion and gratitude. He didn't understand why Austin was being so cold and distant, but anyway he was grateful for his help nonetheless.",
    "Semero and Austin sat in silence for a short while, each lost in their own thoughts. Finally, Austin broke the silence and said, \"We need to go.\" Semero looked up, surprised by the suddenness of the statement. \"Go where?\" he asked. Austin replied, \"We need to get on the road and see if we can find any help. It's not safe for us to stay here any longer.\"",
    "Semero nodded in agreement and they both stood up. They packed their belongings and slung the prince's bags over their shoulders.",
    "Semero and Austin walked for about an hour, passing one high hill after another, until finally they left the ill-fated valley behind them. As they walked, the terrain gradually changed from grassy hills to a dusty plain. Eventually, they came out onto a wide road that cut through the landscape. Road was made of dirt and cobblestones and seemed well-traveled, with deep ruts from wagon wheels and horse hooves.",
    "On the other side of the road was the edge of a dense forest. Trees loomed tall and imposing, casting long shadows over the dusty ground. This forest was dark and foreboding, and Semero felt a shiver run down his spine.",
    "Above, the sky was clear and blue, without a single cloud in sight. Warm sun beat down on them, casting long shadows behind them as they walked. In the distance, they could hear the sound of a brook babbling and the rustle of leaves in the breeze.",
    "Semero and Austin had been walking for hours, tired and weary after a long night of danger and uncertainty. As they trudged along the dusty road, their minds were filled with thoughts of their uncertain future and the many dangers that lay ahead.",
    "Suddenly, they heard a sound behind them, a creaking of wheels and the sound of a voice. \"Where are you going, dears? Give you a ride?\" called out the voice. Semero and Austin turned around and saw a high covered wagon with intricate carvings on the wooden walls and a green cloth covering the roof. Wagon was pulled by two large horses and was being driven by a fat, bearded man in a motley, pointed emerald hat.",
    "Man smiled and beckoned to the two travelers. \"Come, come, climb aboard! I can take both of you wherever you need to go. I am a simple trader, traveling these roads and bringing my wares to the towns and villages.\" he said, his voice friendly and inviting.",
    "Semero and Austin looked at each other, uncertain of what to do. They had no money and nothing to offer in return for a ride, but they were tired and sore from their journey and the offer of a ride was tempting. After a brief moment of hesitation, they climbed aboard the wagon.",
    "Semero and Austin stepped into the magical wagon and were immediately awestruck by what they saw. Inside of the wagon was enormous, with multiple floors and countless doors. In the center of the room, there was a tall tree that grew up towards the roof, its branches stretching out towards the walls. Strange and magical birds flew around, their feathers glistening in the soft light that seemed to emanate from the walls themselves.",
    "Semero was in shock, unable to believe what he was seeing. Austin, on the other hand, grunted strangely and threw the bags against the wall. He seemed to be familiar with this kind of thing.",
    "Suddenly, a girl's voice called out to Semero. He turned to see a tall, pretty girl with a copper-colored braid, wearing a blue cloak and with a dagger in her belt, emerge from behind the tree.",
    "\"Welcome to the wandering wagon, strangers,\" she said with a smile. \"I am Arvanka, and this is my home. What brings you here?\"",
    "\"I'm Austin Jorgall,\" said Austin.",
    "Prince could only look at Arvanka in silence and fascination. Austin noticed this and continued, \"That's Semero. We got lost with him. Then we somehow got onto the road and your charioteer picked us up.\"",
    "Arvanka stepped forward to Semero with a friendly smile and extended her hand. Semero shook it, still in a daze from the magic of the wagon as thought Arvanka. Austin rolled his eyes at Semero's awe and turned to Arvanka, \"So, where are this wagon headed?\" he asked, his tone clipped and business-like.",
    "Arvanka gestured to the growing tree in the center of the wagon, \"We're traveling in search of knowledge and answers,\" she replied mysterly. \"My name is Arvanka, and this is my friend's wagon. We travel the land, seeking to unravel the mysteries of the world.\"",
    "Semero was still amazed by the magical wagon and the wonders inside it."],
  "talkOption": ["\"How is it possible? How does the wagon fit all of this inside it?\" he asked."],
  "talkOptionResult": ["Arvanka smiled kindly at Semero's curiosity, \"This wagon is enchanted, young prince. It's a marvel of magic and technology,\" she explained. \"We have many rooms and floors, all connected by the central tree. And the birds are our scouts and messengers, keeping us informed of the world beyond.\"", "Austin grunted dismissively, uninterested in Arvanka's explanations. \"Well, we appreciate the ride,\" he said."]
}
