{
  "mainText": ["As wagon made its way up rise, prince could see towering peaks of the mountain range looming on horizon. They were shrouded in a mist that seemed to dance and swirl around them, as if alive with its own energy. Prince felt a thrill of excitement run through him - he knew that their journey was just beginning, and that the secrets and wonders of the mountains awaited them.", "Austin Jorgall, a rugged adventurer with a wild look in his eyes, pushed his way through the door of wagon at the cab driver's station to join Semero and wizard. He took a deep breath of fresh morning air and looked around at rocky valley they had been traveling through for what seemed like days.", "\"We must stop at rise and set up camp for a day or two of rest,\" he said, his voice rough with exhaustion. \"We can't risk pushing ourselves too hard on the mountain rises.\"", "Wizard, still focused on the road ahead, responded without turning his head. \"A little further ahead, there is a small forest and a lake,\" he said. \"We will stop there for day and rest. It will provide us with enough shelter and resources to rejuvenate ourselves for the journey ahead.\"", "As wagon continued on, rocky terrain slowly gave way to a lush green forest, its thick foliage providing much-needed shade from sun's rays. Wizard skillfully navigated wagon through winding forest paths until they came upon a shimmering blue lake nestled amongst trees.", "\"We will make camp here,\" wizard announced, bringing wagon to a halt. \"There is plenty of wood for a fire and fresh water for us to drink. We can rest and replenish our supplies before we continue our journey into the mountains.\"", "Group quickly set to work, unloading wagon and setting up a makeshift campsite. They gathered wood for a fire, set up tents, and prepared a simple meal of dried meat and bread. As the night fell, they sat around crackling fire, their bodies weary but their spirits high. They knew that the true test of their strength and resolve lay ahead on the mountain rises, but for now, they would rest and gather their strength for journey ahead.", "As night deepened, wizard and Austin retired to their tents to get some much-needed rest, leaving Semero alone by the crackling fire. He sat there for a while, lost in thought, staring into the dancing flames.", "Suddenly, a familiar voice called out to him. Semero turned to see Arvanka, a beautiful young with wistful look in her eyes, standing just a few steps away from him. Her hair was braided intricately, and she was dressed in a thin, translucent dress that flowed in gentle breeze."],
  "talkOption": ["\"Arvanka, where did you do in that magical wagon?\" Semero asked. \"Why didn't you appear for so long?\""],
  "talkOptionResult": ["Arvanka's expression turned sad as she replied, \"I had things to do, Semero.\" Young prince hesitated for a moment, unsure of what to say next."]
}
