{
  "mainText": ["As wagon came to a halt in front of cave, wizard hopped down from his perch and made his way towards horses. Animals were chilled from long journey through snow, and he knew he needed to take care of them before anything else.", "With practiced ease, he set about rubbing their dry and tending to their needs, making sure they were comfortable and well-fed. Horses neighed their appreciation, their breaths visible in cold mountain air.", "Meanwhile, Austin set to work building a fire, his deft hands moving quickly to gather kindling and dry wood. He struck flint against steel, sending sparks flying until a small flame flickered to life. Gradually, fire grew in size, casting a warm glow across interior of cave.", "Semero, always one to explore his surroundings, took a look around cave. His eyes adjusted to dim light, and he could make out rough walls and uneven floor. He noticed that cave was surprisingly spacious, with enough room for all of them to rest comfortably.", "As he walked further in, he noticed that there was a small stream running through cave, its clear water bubbling over smooth stones. He scooped up a handful and drank, feeling cool liquid quench his thirst.", "With horses tended to, fire blazing, and  exploring, three companions settled into their makeshift shelter for night. They ate what little food they had left, as they huddled close to warmth of fire. And as they drifted off to sleep, Semero knew that they were safe and protected, nestled within shelter of mountain cave.", "Semero's eyes snapped open, his mind still hazy from sleep as he was abruptly awoken by wizard's loud and menacing voice. ", "\"Get up!\" wizard barked, his voice echoing off cave walls.", "Semero's head spun as he tried to make sense of his surroundings, and he felt a hand grab him roughly by scruff of his neck, hoisting him to his feet. Blinking, he looked around and saw something that shocked him to core - a pale girl curled up against one of cave walls. It was Arvanka."],
  "talkOption": ["Running up to her, Semero asked in a voice filled with fear, \"Arvanka, what's matter with you?\""],
  "talkOptionResult": ["Wizard spoke up. \"Mountain sickness. She's very sick,\" he explained, his voice as cold as winter air."]
}
