{
  "mainText": ["Without a moment's hesitation, Semero made his decision."],
  "talkOption": ["\"I agree!\" he exclaimed."],
  "talkOptionResult": ["Wizard's lips twisted into a smug grin. \"Then say that you willingly give me your face!\" he growled.", "\"I voluntarily give my face!\" Semero declared, his voice ringing through cave.", "A blinding flash of light erupted from wizard's hand, causing Semero to shield his eyes and stumble backward against cave wall. As light faded, Semero cautiously lowered his hands and gasped in shock.", "Standing before him, where wizard had been just moments before, was an exact copy of himself, down to last detail. Prince's heart sank as he realized full implications of what he had just done. What would his grandfather say? And what had he gotten himself into with this dangerous and unpredictable wizard?", "Semero was stunned, staring at wizard, who now looked exactly like him. It was an eerie sight, and he couldn't help but feel a shiver run down his spine. Wizard smirked, pleased with himself, and handed  vial of purple liquid to Semero.", "\"Arvanka,\" he reminded him, his voice low and menacing.", "Semero quickly turned his attention to sick girl, feeling a sense of urgency wash over him.", "False Semero, now wearing prince's cloak. Semero watched in horror as wizard's smile turned sinister. \"And one more thing, Semero,\" he said, his voice now laced with malice. \"This medicine needs another ingredient. Dragon's blood.\"", "Realization of what had just happened hit him like a ton of bricks. Wizard had taken his appearance and left him with a helpless girl and a nearly impossible task. Prince's mind raced with implications of wizard's words. He had been sent to kill a dragon, but task had seemed impossible. Now, with wizard's request for dragon's blood, it seemed even more daunting. How was he supposed to obtain such a rare and dangerous substance?", "As if reading his thoughts, false Semero simply chuckled and then turned on his heels, silently making his way towards cave entrance. Raging snowstorm outside had grown stronger, but wizard showed no sign of hesitation or fear. Semero was left alone, staring after him in disbelief and terror.", "He was now trapped in cave, with no way out, and fate of his sick friend and entire kingdom on his shoulders. Weight of task ahead of him threatened to crush him, but he knew he had no choice but to face it head-on.", "He looked over at Arvanka, who lay curled up against cave wall, her breathing labored and her skin pale. He knew he had to act fast to save her.", "Semero took a deep breath and squared his shoulders. He would not give up, no matter how daunting task ahead seemed. He had to find a way to save Arvanka and complete his mission, even if it meant facing a dragon alone."]
}
