{
  "mainText": ["Niran asked looking into his bowl: \"Why are you going east?\" He looked up at Austin. Their eyes met.", "Austin replied, \"We've got business there.\"", "Niran pressed, \"More details?\"", "Austin shook his head and said, \"There won't be more details.\"", "As the night grew darker, fire began to die out, and people slowly dispersed to their tents. Only ones left by the fire were wizard, Austin, Semero, and this old man. Nobody from Nowhere had already laid down to doze off, while Austin took out his grindstone and began sharpening his sword. Semero sat silently with his head on his knees, lost in thought as he looked at the dying embers of fire. Old man also sat there, silently watching the prince. As the sun slowly drifted over hills, it was clear that evening had arrived.", "As Austin finished sharpening his sword, sound of metal against stone filling air, he broke silence with a commanding tone. \"We will go to prepare wagon, and you wait for us at the entrance to the bridge,\" he said to old man. His voice was firm and decisive, leaving no room for argument.", "Old man looked up at him, his eyes narrow and calculating. \"Do you want me to go with you?\" he asked, his voice equally firm.", "Austin nodded. \"Yes,\" he replied.", "Old man seemed to consider this for a moment, his gaze flickering over to Semero and then back to Austin. \"And if I don't want to?\" he asked, his voice calm and unwavering.", "Austin met his gaze, his grip tightening on the hilt of his sword. For a moment, there was silence, as if the air itself was holding its breath. Niran's eyes moved smoothly to the wide blade, taking in its gleaming surface.", "Finally, he spoke again. \"I'll wait for you,\" he said, his tone resigned but not defeated.", "Austin nodded in acknowledgment, then turned to Semero. \"Come on, we have work to do,\" he said, gesturing towards wagon.", "Semero rose to his feet, his face a mask of apprehension. He followed Austin silently, casting a last glance back at old man before turning away.", "As they walked towards wagon, sky was slowly turning orange and pink, sun sinking behind the hills. Air was cool and crisp, breeze carrying the faint scent of woodsmoke and distant sound of rushing water.", "Together, Austin and Semero began to ready wagon for their journey east. They loaded up supplies and checked the wheels, making sure everything was in good condition. All the while, Semero's mind was racing with thoughts of what lay ahead - dangers, unknowns, risks.", "As he worked, old man's words echoed in his mind. Border guards, night watchmen, dragon. It all seemed so surreal, like a story from a far-off land. But he knew that they had to press on, he had to complete mission no matter what.", "Finally, as the last of supplies were loaded and secured, Austin turned to Semero. \"Let's go,\" he said, his voice low and determined.", "Together, they set off towards the bridge, old man waiting for them at the entrance. As they approached, they could see the outline of guards, their forms dark against the fading light.", "For a moment, they hesitated, unsure of what to do. But then Austin stepped forward, his sword at his side. Old man followed him, his gnarled stick tapping on the ground.", "As they reached the guards, Austin spoke. \"We need to cross the bridge,\" he said, his voice strong and steady.", "The guards looked them up and down, their eyes narrowing suspiciously. \"What business do you have on the other side?\" one of them asked, his tone aggressive.", "Austin met his gaze, his eyes flashing. \"That's none of your concern,\" he replied, his voice cold.", "There was a tense moment of silence, guards sizing them up. But then, to their surprise, one of guards spoke up. \"How much coin do you have?\" he asked, his voice low and greedy.", "Austin reached into his pocket and pulled out a bag of gold coins, jingling them in his hand. \"This enough?\"", "Guards counted them carefully before nodding and stepping aside to let them pass.", "As they crossed the bridge, Austin breathed a sigh of relief. They were one step closer to their destination. On the other side, Niran was waiting for them. He bid them farewell and wished them luck on their journey.", "Austin, Semero, and wizard continued on their way, sound of the wagon wheels turning on the dirt road only sound in the stillness of the evening. Sun had almost set, casting a golden glow over the land. As they journeyed on, they could see the mountains in the distance, their peaks shrouded in mist.", "Wizard broke the silence, muttering a spell under his breath. A soft breeze began to blow, carrying the scent of pine and wildflowers."],
  "talkOption": ["\"That's good.\" Semero looked over at the wizard."],
  "talkOptionResult": ["Semero could see a glint of magic in his eyes. As they continued on, the night fell, and the stars appeared overhead. Wizard conjured a ball of light, which hovered above wagon, casting a warm glow. They journeyed on through night, the sound of wagon and the soft hum of the wizard's magic the only sounds in the stillness."]
}
