{
  "mainText": [
    "As sun descended by sky, painting it with a fiery glow, a horse galloped along winding road that snaked through lush valley of emerald grass. Horse was ridden by two figures, fair-haired prince Semero and equally fair-haired girl Arvanka. Both looked weary and burdened, their once-gleaming eyes now dulled with exhaustion.",
    "As they approached a solitary tree that marked roadside, prince brought the horse to a halt. With a deep sigh, he announced, \"I'll go by myself.\"",
    "In the distance loomed a towering castle, place where prince was born and raised. Its spires and turrets reached high into the sky, casting shadows across the valley. Arvanka, sensing the prince's reluctance, implored him, \"You don't need go there, Semero. Let us journey far away from this place, where we can begin anew.\"",
    "Semero remained silent, his gaze fixed on the distant castle. Memories flooded his mind, of days he had spent within those walls.",
    "Air betwen prince and a girl was thick with tension. Sun had long since slipped below horizon, and sky was now a deep shade of indigo, dotted with stars that glimmered like diamonds. Yet despite the beauty of night, prince's mind was troubled.",
    "\"I cannot abandon my people,\" Semero said, his voice low and heavy with emotion.",
    "Arvanka's grip on his hand tightened, her blue eyes full of worry. \"But you will not be believed,\" she pleaded. \"He will execute you.\"",
    "Prince looked down at young girl, a mix of emotions churning within him. He knew that she was right. Yet he also knew that he could not simply turn his back on his responsibilities.",
    "At last, Semero spoke. \"Wait here,\" he said, his voice firm but gentle. \"I must go and face my fate, whatever it may be. But know that I will return to you, my dear Arvanka. You are the light that guides me in this dark.\"",
    "With a heavy heart, Semero urged his horse forward, towards imposing castle that awaited him. Arvanka watched him go. ",
    "Her heart heavy with fear and longing."
  ]
}
